import math

ln_sn = 157
cnt = 12_450
mem = 955 * 1024  # byte

size_sn = math.floor(mem / cnt)  # byte / sn
print(size_sn)  # 78
size_smb = math.floor(size_sn * 8 / 157)  # bit / smb
print(size_smb)  # 3 bit / smb


ln_al = 8  # так как 3 bit / smb

size_smb = 3
size_sn = math.ceil(size_smb * ln_sn / 8)
print(size_sn, size_sn * cnt / 1024, 955)

"""
На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 157 символов. В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное целое число байт. При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 12 450 серийных номеров отведено не более 955 Кбайт памяти. Определите максимально возможную мощность алфавита, используемого для записи серийных номеров. В ответе запишите только целое число.
"""
