
"""
Сначала найдите, из скольки символов составлялись автоматические пароли, 
если на 256 паролей было выделено 2 килобайта. 

Составлены пароли из букв английского алфавита (строчных и прописных) и десятичных цифр. 

Каждый символ данных кодируется отдельно наименьшим количеством бит. 

Пароль целиком кодируется наименьшим количеством байт.

В каждом пароле лишние данные занимают целых 8 символов. 

Определите, сколько символов остаётся на смысловую часть пароля.

В ответе запишите только целое число — количество символов.
"""

# 2 * 1024 / 256 = 8 bytes
# 26+26+10 = 62 => 6 bits
# 8 * 8 / 6 = 10 symbols
# 10 - 8 = 2 symbols = ответ

# = = = = = = = = = = = = = 

"""
Для пароля использовали большие буквы английского алфавита. 
Длина пароля — 4 символа. Каждая буква пароля кодируется в битах, 
а для целого пароля отводится какое-то целое, но минимальное количество байт.

Сколько байт занимает кодирование паролей для десяти пользователей?
26 => 5
4 * 5 = 20 => 3 bytes => 30 - ответ

Для пароля использовали большие буквы английского алфавита. 
Длина пароля — 5 символов.
Сколько бит занимает кодирование одного пароля?

26 => 5 bit => 5 * 5 = 25 bit - ответ
"""